# # 算数运算的优先级 --> ** --> * / // % --> + -
# print("0.1 + 10 / 4**2 =",0.1 + 10 / 4**2)
#
# # # 案例: 输出两个数 x 和 y,计算x + y以及x - y的结果并输出
# # # 0.09999999999999998 --> 精度损失, 由于计算机底层是基于 二进制 进行数据的存储与处理, 二进制是无法准确的来表示所有的小数, 因此设计浮点数的计算, 可能会损失精度
# # x = float(input("请输入x的值: "))
# # y = float(input("请输入y的值: "))
# # print(f"x + y = {x + y},",f"x - y = {x - y}")
# num = 85
# num %= 3
# print(num)

# 比较运算符
# 逻辑运算符

num = float(input("请输入一个数"))
print(f"{num}在10-20之间: ",num >= 10.0 and num <= 20.0)

num1 = float(input("请再出输入一个数: "))
print(f"{num1}不在10-20之间: ",num1 < 10 or num1 > 20)
